InformationRegisters/КредитныеИсторииДанныеСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КредитныеИсторииДанныеСделки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыходаНаПросрочку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПередачиФинансирования</Name>
					<Comment>Обычно совпадает с датой начала договора, но может быть датой РКО</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаСрочнойЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаПросроченнойЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СолидарныйДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорМКЗ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорМикрозайма</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеструктуризацияМКЗ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеструктуризацияМикрозайма</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обеспечительство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Обеспечительства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СудебноеДело</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрекращениеОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеденежноеОбязательство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НеденежныеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочка90плюс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакПотребительскогоКредита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНБКИВидКредита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНБКИТипКредита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНБКИЦельКредита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прощение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОбИзмененииДоговора</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Банкротство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ДелоОБанкротстве</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесудебноеБанкротствоДолжника</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезнадежныйДолг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗаимодавца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастичноеПравопреемство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакКредитнойЛинии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНБКИТипКредититнойЛинии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакПлавающейПроцентнойСтавки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВозникновенияОбязательстваСубъекта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядковыйНомерТранша</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавкаПоУсловиям</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастичнаяПродажа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UIDРефинансированнойСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяПроцентнаяСтавкаПоУсловиям</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакПредусмотренногоГрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КредитныеИсторииСобытияСделки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументСобытие</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/УправлениеКИ/Ext/Form/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере(Отказ)
	ЭтаФорма.РольАБД = РольДоступна("АБД");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получить непредопредленное значение с сервера
	ПриОткрытииНаСервере(Отказ);
	// Проверить права доступа
	Если ЭтаФорма.РольАБД = Ложь Тогда
		Предупреждение("Нарушение прав доступа",,"Предупреждение");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСобытияКИНаСервере()
	ЭтаФорма.НастройкаВыгрузкиКИ = Справочники.НастройкиВыгрузкиКредитныхИсторий.НайтиПоКоду("000000001");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСобытияКИ(Команда)
	ЗаполнитьСобытияКИНаСервере();
	Массив = Элементы.Список.ВыделенныеСтроки;	
	Ном = 1;
	Для Каждого Эл Из Массив Цикл
		Состояние("Интеграция с НБКИ", Цел(Ном * 100 / (Массив.Количество() + 1)),"Пожалуйста, подождите...",БиблиотекаКартинок.NC_ПодсистемаОбменСНБКИ);
		Ном = Ном + 1;
		ФормаНастроек = ПолучитьФорму("Справочник.НастройкиВыгрузкиКредитныхИсторий.ФормаОбъекта", Новый Структура("Ключ", ЭтаФорма.НастройкаВыгрузкиКИ));
		ФормаНастроек.Обязательство = Элементы.Список.ДанныеСтроки(Эл).Ссылка;
		ФормаНастроек.Должник = Элементы.Список.ДанныеСтроки(Эл).Должник;
		ФормаНастроек.ПервичноеЗаполнениеПоОдномуДО(Неопределено);
	КонецЦикла;	
	Состояние(, 100);
КонецПроцедуры

&НаСервере
Процедура ПрекратитьОбязательствоНаСервере(Ссылка)
	ИсходноеСобытие = РегистрыСведений.КредитныеИсторииДанныеСделки.СоздатьМенеджерЗаписи();
	
	ИсходноеСобытие.Сделка = Ссылка;
	ИсходноеСобытие.ДатаСобытия = ОбъектыСервер.ПолучитьЗначениеСвойства(Ссылка, "0158");
	ИсходноеСобытие.Событие = Справочники.КредитныеИсторииСобытияСделки.НайтиПоНаименованию("Правопреемство от другого лица");
	ИсходноеСобытие.ДокументСобытие = Справочники.НастройкиВыгрузкиКредитныхИсторий.НайтиПоКоду("000000001");
	ИсходноеСобытие.Прочитать();
	Если ИсходноеСобытие.Выбран() Тогда
		НовоеСобытие = РегистрыСведений.КредитныеИсторииДанныеСделки.СоздатьМенеджерЗаписи();
		НовоеСобытие.Событие = Справочники.КредитныеИсторииСобытияСделки.НайтиПоНаименованию("Обязательство субъекта прекратилось");
		ЗаполнитьЗначенияСвойств(НовоеСобытие, ИсходноеСобытие, , "Событие");
	Иначе
		Сообщить("Для ДО " + Ссылка + " не найдено событие правопреемства! Обработка пропущена");
		Возврат;
	КонецЕсли;
	
	НовоеСобытие.Записать();
	
	СобытиеПрекращения = РегистрыСведений.КредитныеИсторииДанныеСделки.СоздатьМенеджерЗаписи();
	
	СобытиеПрекращения.Сделка = Ссылка;
	СобытиеПрекращения.ДатаСобытия = ОбъектыСервер.ПолучитьЗначениеСвойства(Ссылка, "0158");
	СобытиеПрекращения.Событие = Справочники.КредитныеИсторииСобытияСделки.НайтиПоНаименованию("Обязательство субъекта прекратилось");
	СобытиеПрекращения.ДокументСобытие = Справочники.НастройкиВыгрузкиКредитныхИсторий.НайтиПоКоду("000000001");
	СобытиеПрекращения.Прочитать();
	СобытиеПрекращения.ДатаСобытия = ТекущаяДата();
	СобытиеПрекращения.ДатаРасчетаСрочнойЗадолженности = ТекущаяДата();
	СобытиеПрекращения.ДатаРасчетаПросроченнойЗадолженности = ТекущаяДата();
	СобытиеПрекращения.ПрекращениеОбязательства = "1";
	СобытиеПрекращения.Просрочка90плюс = "0";	
	
	СобытиеПрекращения.Записать();
	Сообщить("Действие ДО " + Ссылка + " прекращено");
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьОбязательство(Команда)
	Массив = Элементы.Список.ВыделенныеСтроки;	
	Ном = 1;
	Для Каждого Эл Из Массив Цикл	
		Состояние("Интеграция с НБКИ", Цел(Ном * 100 / (Массив.Количество() + 1)),"Пожалуйста, подождите...",БиблиотекаКартинок.NC_ПодсистемаОбменСНБКИ);
		Ном = Ном + 1;
		Ссылка = Элементы.Список.ДанныеСтроки(Эл).Ссылка;
		КомандаWindows = "Timeout /T " + Формат(10, "ЧГ=0") + " /NoBreak";
		WshShell = Новый COMОбъект("WScript.Shell"); 
		WshShell.Run(КомандаWindows, 0, -1);
		ПрекратитьОбязательствоНаСервере(Ссылка);
	КонецЦикла;	
	Состояние(, 100);
КонецПроцедуры

&НаСервере
Процедура ПрекратитьОбязательствоБанкротствоНаСервере(Ссылка)
	ИсходноеСобытие = РегистрыСведений.КредитныеИсторииДанныеСделки.СоздатьМенеджерЗаписи();
	
	ИсходноеСобытие.Сделка = Ссылка;
	ИсходноеСобытие.ДатаСобытия = ОбъектыСервер.ПолучитьЗначениеСвойства(Ссылка, "0158");
	ИсходноеСобытие.Событие = Справочники.КредитныеИсторииСобытияСделки.НайтиПоНаименованию("Правопреемство от другого лица");
	ИсходноеСобытие.ДокументСобытие = Справочники.НастройкиВыгрузкиКредитныхИсторий.НайтиПоКоду("000000001");
	ИсходноеСобытие.Прочитать();
	Если ИсходноеСобытие.Выбран() Тогда
		НовоеСобытие = РегистрыСведений.КредитныеИсторииДанныеСделки.СоздатьМенеджерЗаписи();
		НовоеСобытие.Событие = Справочники.КредитныеИсторииСобытияСделки.НайтиПоНаименованию("Обязательство субъекта прекратилось");
		ЗаполнитьЗначенияСвойств(НовоеСобытие, ИсходноеСобытие, , "Событие");
	Иначе
		Сообщить("Для ДО " + Ссылка + " не найдено событие правопреемства! Обработка пропущена");
		Возврат;
	КонецЕсли;
	
	НовоеСобытие.Записать();
	
	СобытиеПрекращения = РегистрыСведений.КредитныеИсторииДанныеСделки.СоздатьМенеджерЗаписи();
	
	СобытиеПрекращения.Сделка = Ссылка;
	СобытиеПрекращения.ДатаСобытия = ОбъектыСервер.ПолучитьЗначениеСвойства(Ссылка, "0158");
	СобытиеПрекращения.Событие = Справочники.КредитныеИсторииСобытияСделки.НайтиПоНаименованию("Обязательство субъекта прекратилось");
	СобытиеПрекращения.ДокументСобытие = Справочники.НастройкиВыгрузкиКредитныхИсторий.НайтиПоКоду("000000001");
	СобытиеПрекращения.Прочитать();
	СобытиеПрекращения.ДатаСобытия = ТекущаяДата();
	СобытиеПрекращения.ДатаРасчетаСрочнойЗадолженности = ТекущаяДата();
	СобытиеПрекращения.ДатаРасчетаПросроченнойЗадолженности = ТекущаяДата();
	СобытиеПрекращения.ПрекращениеОбязательства = "1";
	// Установить признак банкротства
	СобытиеПрекращения.Банкротство = "1";
	СобытиеПрекращения.Просрочка90плюс = "0";	
	
	СобытиеПрекращения.Записать();
	Сообщить("Действие ДО " + Ссылка + " прекращено по причине банкротства");
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьОбязательствоБанкротство(Команда)
	Массив = Элементы.Список.ВыделенныеСтроки;	
	Ном = 1;
	Для Каждого Эл Из Массив Цикл	
		Состояние("Интеграция с НБКИ", Цел(Ном * 100 / (Массив.Количество() + 1)),"Пожалуйста, подождите...",БиблиотекаКартинок.NC_ПодсистемаОбменСНБКИ);
		Ном = Ном + 1;
		Ссылка = Элементы.Список.ДанныеСтроки(Эл).Ссылка;
		КомандаWindows = "Timeout /T " + Формат(10, "ЧГ=0") + " /NoBreak";
		WshShell = Новый COMОбъект("WScript.Shell"); 
		WshShell.Run(КомандаWindows, 0, -1);
		ПрекратитьОбязательствоБанкротствоНаСервере(Ссылка);
	КонецЦикла;	
	Состояние(, 100);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетВНБКИ(Команда)
	ЗаполнитьСобытияКИНаСервере();
	ФормаДокументаОтчета = ПолучитьФорму("Документ.НБКИДокументRUTDF.ФормаОбъекта");
	ФормаДокументаОтчета.Объект.Дата = ТекущаяДата();
	ФормаДокументаОтчета.Объект.НастройкаВыгрузки = ЭтаФорма.НастройкаВыгрузкиКИ;
	ФормаДокументаОтчета.НастройкаВыгрузкиПриИзменении(ФормаДокументаОтчета.Объект.НастройкаВыгрузки);
	Массив = Элементы.Список.ВыделенныеСтроки;	
	Ном = 1;
	Для Каждого Эл Из Массив Цикл
		Состояние("Интеграция с НБКИ", Цел(Ном * 100 / (Массив.Количество() + 1)),"Пожалуйста, подождите...",БиблиотекаКартинок.NC_ПодсистемаОбменСНБКИ);
		Ном = Ном + 1;
		ОбновляемаяЗапись = ФормаДокументаОтчета.Объект.тчОбновляемыеЗаписиB.Добавить();
		ОбновляемаяЗапись.ОбъектУчета = Элементы.Список.ДанныеСтроки(Эл).Ссылка;
		ОбновляемаяЗапись.Должник = Элементы.Список.ДанныеСтроки(Эл).Должник;
		// Создать служебное мероприятие
		СоздатьМероприятиеВыгрузки(Элементы.Список.ДанныеСтроки(Эл).Ссылка);
	КонецЦикла;
	ПараметрыЗаписи = Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение);
	ФормаДокументаОтчета.Записать(ПараметрыЗаписи);
	ФормаДокументаОтчета.СформироватьОтчет(Неопределено);
	Состояние(, 100);
КонецПроцедуры

&НаСервере
Процедура СоздатьМероприятиеВыгрузки(Объект)
	НовоеМероприятие = Задачи.Мероприятие.СоздатьЗадачу();	
	НовоеМероприятие.Автор = ПараметрыСеанса.ТекущийПользователь;
	НовоеМероприятие.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	НовоеМероприятие.Дата = ТекущаяДата();
	НовоеМероприятие.ВремяСоздания = ТекущаяДата();
	НовоеМероприятие.ПланируемаяДата = ТекущаяДата();
	НовоеМероприятие.ДатаВыполнения = ТекущаяДата();
	НовоеМероприятие.ФактическаяДата = ТекущаяДата();
	НовоеМероприятие.ДлительностьРазговора = "0:00:00";
	НовоеМероприятие.Объект = Объект;
	НовоеМероприятие.ТипМероприятия = Справочники.ТипыМероприятий.НайтиПоНаименованию("Служебное");
	НовоеМероприятие.Результат = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Выгрузка в НБКИ");
	НовоеМероприятие.Выполнена = Истина;
	НовоеМероприятие.Записать();
КонецПроцедуры
